Revit 2026 API

# ReinforcementSettingsIsEqual Method

---

Checks if Reinforcement Settings is equal to other

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEqual(
	ReinforcementSettings other
)
```
```vb
Public Function IsEqual (
	other As ReinforcementSettings
) As Boolean
```
```cpp
public:
bool IsEqual(
	ReinforcementSettings^ other
)
```
```fsharp
member IsEqual :
        other : ReinforcementSettings -> bool
```

#### Parameters

other ReinforcementSettings

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ReinforcementSettings Class

Autodesk.Revit.DB.Structure Namespace